packages/easy_onvif/test/xml/SUNBA.405/media1/GetStreamUri.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
    xmlns:a="http://www.w3.org/2005/08/addressing">
    <s:Header></s:Header>
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <GetStreamUri xmlns="http://www.onvif.org/ver10/media/wsdl">
            <StreamSetup xmlns="http://www.onvif.org/ver10/media/wsdl">
                <Stream xmlns="http://www.onvif.org/ver10/schema">RTP-Unicast</Stream>
                <Transport xmlns="http://www.onvif.org/ver10/schema">
                    <Protocol xmlns="http://www.onvif.org/ver10/schema">RTSP</Protocol>
                </Transport>
            </StreamSetup>
            <ProfileToken>000</ProfileToken>
        </GetStreamUri>
    </s:Body>
</s:Envelope>
