venc/libs/xmlwrapper/sample/namespace.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope 
	xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
	xmlns:trt="http://www.onvif.org/ver10/media/wsdl" 
	xmlns:tt="http://www.onvif.org/ver10/schema">
	<soap:Body>
		<trt:GetStreamUri>
			<trt:StreamSetup>    
				<tt:Stream>RTP-Unicast</tt:Stream>    
				<tt:Transport>
					<tt:Protocol>UDP</tt:Protocol>    
				</tt:Transport>  
			</trt:StreamSetup>  
			<trt:ProfileToken>Profile1</trt:ProfileToken>
		</trt:GetStreamUri>
	</soap:Body>
</soap:Envelope>
