test/fixtures/vcr_cassettes/get_video_sources.json

[
  {
    "request": {
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n    <SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://www.w3.org/2003/05/soap-envelope\"\n    xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\"\n    xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis=200401-wss-wssecurity-utility-1.0.xsd\">\n    <SOAP-ENV:Header><wsse:Security><wsse:UsernameToken>\n    <wsse:Username>admin</wsse:Username>\n    <wsse:Password Type=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest\">g7hcQe3/GXxreclWUFGN+OQxZfU=</wsse:Password>\n    <wsse:Nonce>w4PDmMKVfxcRNUzCu8KWwpLDsHfCnWnCt8OPK8OqwpfDsA==</wsse:Nonce>\n    <wsu:Created>2016-02-24T00:21:02Z</wsu:Created></wsse:UsernameToken>\n    </wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body>\n    <trt:GetVideoSources xmlns:trt=\"http://www.onvif.org/ver10/media/wsdl\"></trt:GetVideoSources>\n    </SOAP-ENV:Body></SOAP-ENV:Envelope>",
      "headers": {
        "Content-Type": "application/soap+xml",
        "SOAPAction": "http://www.w3.org/2003/05/soap-envelope"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "http://recorded_response/onvif/Media"
    },
    "response": {
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\r\n<env:Envelope xmlns:env=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:soapenc=\"http://www.w3.org/2003/05/soap-encoding\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xs=\"http://www.w3.org/2001/XMLSchema\" xmlns:tt=\"http://www.onvif.org/ver10/schema\" xmlns:tds=\"http://www.onvif.org/ver10/device/wsdl\" xmlns:trt=\"http://www.onvif.org/ver10/media/wsdl\" xmlns:timg=\"http://www.onvif.org/ver20/imaging/wsdl\" xmlns:tev=\"http://www.onvif.org/ver10/events/wsdl\" xmlns:tptz=\"http://www.onvif.org/ver20/ptz/wsdl\" xmlns:tan=\"http://www.onvif.org/ver20/analytics/wsdl\" xmlns:tst=\"http://www.onvif.org/ver10/storage/wsdl\" xmlns:ter=\"http://www.onvif.org/ver10/error\" xmlns:dn=\"http://www.onvif.org/ver10/network/wsdl\" xmlns:tns1=\"http://www.onvif.org/ver10/topics\" xmlns:tmd=\"http://www.onvif.org/ver10/deviceIO/wsdl\" xmlns:wsdl=\"http://schemas.xmlsoap.org/wsdl\" xmlns:wsoap12=\"http://schemas.xmlsoap.org/wsdl/soap12\" xmlns:http=\"http://schemas.xmlsoap.org/wsdl/http\" xmlns:d=\"http://schemas.xmlsoap.org/ws/2005/04/discovery\" xmlns:wsadis=\"http://schemas.xmlsoap.org/ws/2004/08/addressing\" xmlns:wsnt=\"http://docs.oasis-open.org/wsn/b-2\" xmlns:wsa=\"http://www.w3.org/2005/08/addressing\" xmlns:wstop=\"http://docs.oasis-open.org/wsn/t-1\" xmlns:wsrf-bf=\"http://docs.oasis-open.org/wsrf/bf-2\" xmlns:wsntw=\"http://docs.oasis-open.org/wsn/bw-2\" xmlns:wsrf-rw=\"http://docs.oasis-open.org/wsrf/rw-2\" xmlns:wsaw=\"http://www.w3.org/2006/05/addressing/wsdl\" xmlns:wsrf-r=\"http://docs.oasis-open.org/wsrf/r-2\" xmlns:trc=\"http://www.onvif.org/ver10/recording/wsdl\" xmlns:tse=\"http://www.onvif.org/ver10/search/wsdl\" xmlns:trp=\"http://www.onvif.org/ver10/replay/wsdl\" xmlns:tnshik=\"http://www.hikvision.com/2011/event/topics\" xmlns:hikwsd=\"http://www.onvifext.com/onvif/ext/ver10/wsdl\" xmlns:hikxsd=\"http://www.onvifext.com/onvif/ext/ver10/schema\"><env:Body><trt:GetVideoSourcesResponse><trt:VideoSources token=\"VideoSource_1\"><tt:Framerate>25</tt:Framerate>\r\n<tt:Resolution><tt:Width>1920</tt:Width>\r\n<tt:Height>1080</tt:Height>\r\n</tt:Resolution>\r\n<tt:Imaging><tt:BacklightCompensation><tt:Mode>OFF</tt:Mode>\r\n<tt:Level>0</tt:Level>\r\n</tt:BacklightCompensation>\r\n<tt:Brightness>50</tt:Brightness>\r\n<tt:ColorSaturation>50</tt:ColorSaturation>\r\n<tt:Contrast>50</tt:Contrast>\r\n<tt:Exposure><tt:Mode>AUTO</tt:Mode>\r\n<tt:Priority>LowNoise</tt:Priority>\r\n<tt:Window bottom=\"0\" top=\"0\" right=\"0\" left=\"0\"/>\r\n<tt:MinExposureTime>33</tt:MinExposureTime>\r\n<tt:MaxExposureTime>20000</tt:MaxExposureTime>\r\n<tt:MinGain>0</tt:MinGain>\r\n<tt:MaxGain>0</tt:MaxGain>\r\n<tt:MinIris>-24</tt:MinIris>\r\n<tt:MaxIris>-3</tt:MaxIris>\r\n<tt:ExposureTime>20000</tt:ExposureTime>\r\n<tt:Gain>0</tt:Gain>\r\n<tt:Iris>-3</tt:Iris>\r\n</tt:Exposure>\r\n<tt:Focus><tt:AutoFocusMode>MANUAL</tt:AutoFocusMode>\r\n<tt:DefaultSpeed>1</tt:DefaultSpeed>\r\n<tt:NearLimit>600</tt:NearLimit>\r\n<tt:FarLimit>0</tt:FarLimit>\r\n</tt:Focus>\r\n<tt:IrCutFilter>ON</tt:IrCutFilter>\r\n<tt:Sharpness>50</tt:Sharpness>\r\n<tt:WideDynamicRange><tt:Mode>OFF</tt:Mode>\r\n<tt:Level>0</tt:Level>\r\n</tt:WideDynamicRange>\r\n<tt:WhiteBalance><tt:Mode>AUTO</tt:Mode>\r\n<tt:CrGain>0</tt:CrGain>\r\n<tt:CbGain>0</tt:CbGain>\r\n</tt:WhiteBalance>\r\n</tt:Imaging>\r\n</trt:VideoSources>\r\n</trt:GetVideoSourcesResponse>\r\n</env:Body>\r\n</env:Envelope>\r\n",
      "headers": {
        "Date": "Wed, 24 Feb 2016 00:20:48 GMT",
        "Server": "App-webs/",
        "Connection": "close",
        "Content-Length": "3287",
        "Content-Type": "application/soap+xml; charset=utf-8"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]
