test/fixtures/vcr_cassettes/error_bad_parameter.json

[
  {
    "request": {
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n    <SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://www.w3.org/2003/05/soap-envelope\"\n    xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\"\n    xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis=200401-wss-wssecurity-utility-1.0.xsd\">\n    <SOAP-ENV:Header><wsse:Security><wsse:UsernameToken>\n    <wsse:Username>admin</wsse:Username>\n    <wsse:Password Type=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest\">Bnc/YaNMZqkQ+c0uPdeHeSwNC8M=</wsse:Password>\n    <wsse:Nonce>OsOpVsKAIBR8MGd9wrHDnDB7w6bDs8KKbDfCj8KS</wsse:Nonce>\n    <wsu:Created>2016-02-25T11:33:10Z</wsu:Created></wsse:UsernameToken>\n    </wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body>\n    <trt:GetSnapshotUri xmlns:trt=\"http://www.onvif.org/ver10/media/wsdl\"><ProfileToken>Foo</ProfileToken></trt:GetSnapshotUri>\n    </SOAP-ENV:Body></SOAP-ENV:Envelope>",
      "headers": {
        "Content-Type": "application/soap+xml",
        "SOAPAction": "http://www.w3.org/2003/05/soap-envelope"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "http://recorded_response/onvif/Media"
    },
    "response": {
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\r\n<env:Envelope xmlns:env=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:soapenc=\"http://www.w3.org/2003/05/soap-encoding\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xs=\"http://www.w3.org/2001/XMLSchema\" xmlns:tt=\"http://www.onvif.org/ver10/schema\" xmlns:tds=\"http://www.onvif.org/ver10/device/wsdl\" xmlns:trt=\"http://www.onvif.org/ver10/media/wsdl\" xmlns:timg=\"http://www.onvif.org/ver20/imaging/wsdl\" xmlns:tev=\"http://www.onvif.org/ver10/events/wsdl\" xmlns:tptz=\"http://www.onvif.org/ver20/ptz/wsdl\" xmlns:tan=\"http://www.onvif.org/ver20/analytics/wsdl\" xmlns:tst=\"http://www.onvif.org/ver10/storage/wsdl\" xmlns:ter=\"http://www.onvif.org/ver10/error\" xmlns:dn=\"http://www.onvif.org/ver10/network/wsdl\" xmlns:tns1=\"http://www.onvif.org/ver10/topics\" xmlns:tmd=\"http://www.onvif.org/ver10/deviceIO/wsdl\" xmlns:wsdl=\"http://schemas.xmlsoap.org/wsdl\" xmlns:wsoap12=\"http://schemas.xmlsoap.org/wsdl/soap12\" xmlns:http=\"http://schemas.xmlsoap.org/wsdl/http\" xmlns:d=\"http://schemas.xmlsoap.org/ws/2005/04/discovery\" xmlns:wsadis=\"http://schemas.xmlsoap.org/ws/2004/08/addressing\" xmlns:wsnt=\"http://docs.oasis-open.org/wsn/b-2\" xmlns:wsa=\"http://www.w3.org/2005/08/addressing\" xmlns:wstop=\"http://docs.oasis-open.org/wsn/t-1\" xmlns:wsrf-bf=\"http://docs.oasis-open.org/wsrf/bf-2\" xmlns:wsntw=\"http://docs.oasis-open.org/wsn/bw-2\" xmlns:wsrf-rw=\"http://docs.oasis-open.org/wsrf/rw-2\" xmlns:wsaw=\"http://www.w3.org/2006/05/addressing/wsdl\" xmlns:wsrf-r=\"http://docs.oasis-open.org/wsrf/r-2\" xmlns:trc=\"http://www.onvif.org/ver10/recording/wsdl\" xmlns:tse=\"http://www.onvif.org/ver10/search/wsdl\" xmlns:trp=\"http://www.onvif.org/ver10/replay/wsdl\" xmlns:tnshik=\"http://www.hikvision.com/2011/event/topics\" xmlns:hikwsd=\"http://www.onvifext.com/onvif/ext/ver10/wsdl\" xmlns:hikxsd=\"http://www.onvifext.com/onvif/ext/ver10/schema\"><env:Body><env:Fault><env:Code><env:Value>env:Sender</env:Value>\r\n<env:Subcode><env:Value>ter:InvalidArgVal</env:Value>\r\n<env:Subcode><env:Value>ter:NoProfile</env:Value>\r\n</env:Subcode>\r\n</env:Subcode>\r\n</env:Code>\r\n<env:Reason><env:Text xml:lang=\"en\">The requested profile token ProfileToken does not exist.</env:Text>\r\n</env:Reason>\r\n<env:Node>http://www.w3.org/2003/05/soap-envelope/node/ultimateReceiver</env:Node>\r\n<env:Role>http://www.w3.org/2003/05/soap-envelope/role/ultimateReceiver</env:Role>\r\n<env:Detail><env:Text>No such profile</env:Text>\r\n</env:Detail>\r\n</env:Fault>\r\n</env:Body>\r\n</env:Envelope>\r\n",
      "headers": {
        "Date": "Thu, 25 Feb 2016 11:32:58 GMT",
        "Server": "App-webs/",
        "Connection": "close",
        "Content-Length": "2491",
        "Content-Type": "application/soap+xml; charset=utf-8"
      },
      "status_code": 500,
      "type": "ok"
    }
  }
]
